In [1]:
import numpy as np
import pandas as pd

In [10]:
data = {'company':['GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FB','FB'],
       'Person':['Lokesh','Ashish','Meghana','Krithika','Indrasena','Amogha'],
       'Sales':[200,210,240,200,210,180]}

In [11]:
data

{'company': ['GOOGLE', 'GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FB', 'FB'],
 'Person': ['Lokesh', 'Ashish', 'Meghana', 'Krithika', 'Indrasena', 'Amogha'],
 'Sales': [200, 210, 240, 200, 210, 180]}

In [20]:
df = pd.DataFrame(data)
df

     company     Person  Sales
0     GOOGLE     Lokesh    200
1     GOOGLE     Ashish    210
2  MICROSOFT    Meghana    240
3  MICROSOFT   Krithika    200
4         FB  Indrasena    210
5         FB     Amogha    180

## Groupby and aggregate functions

In [14]:
byComp = df.groupby('company')

In [17]:
byComp.mean()

           Sales
company
FB           195
GOOGLE       205
MICROSOFT    220

In [18]:
byComp.sum()

           Sales
company
FB           390
GOOGLE       410
MICROSOFT    440

In [23]:
byComp.std()

               Sales
company
FB         21.213203
GOOGLE      7.071068
MICROSOFT  28.284271

In [25]:
byComp.count()

           Person  Sales
company
FB              2      2
GOOGLE          2      2
MICROSOFT       2      2

In [26]:
byComp.max()

              Person  Sales
company
FB         Indrasena    210
GOOGLE        Lokesh    210
MICROSOFT    Meghana    240

## All the above can be done in a single line command

In [22]:
df.groupby('company').sum().loc['GOOGLE']

Sales    410
Name: GOOGLE, dtype: int64

In [29]:
df.groupby('company').describe()      # used to get all the aggregate function values   ,
                                # add( .transpose() )to change the format of the table

          Sales
          count   mean        std    min    25%    50%    75%    max
company
FB          2.0  195.0  21.213203  180.0  187.5  195.0  202.5  210.0
GOOGLE      2.0  205.0   7.071068  200.0  202.5  205.0  207.5  210.0
MICROSOFT   2.0  220.0  28.284271  200.0  210.0  220.0  230.0  240.0